app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R', 'NC-17') ORDER BY release_date
---
  def index

    redirect=false
    @all_ratings=Movie.ratings

    if params[:ratings]
       @filter=params[:ratings]
    elsif session[:ratings]
       @filter=session[:ratings]
       redirect=true
    else
       temp=Hash.new()
       @all_ratings.each do |x|